module Kirpich
  YES_NO = [
    'да',
    'нет',
    'возможно'
  ]

  NO_GIRLS = [
    'чет там нет нихуя',
    'ПОТРАЧЕНО',
    'кончились фотки',
    'сами ищите еп'
  ]

  GLAV = [
    "я! епт",
    "я! нах",
    "да я же бл.",
    "я",
  ]

  SIN = [
    "синька — чмо",
    "синька — мразь",
    "синька — мразь ваще",
  ]

  HELP = "
  я могу пиздануть в чат, сиськи, жопу или какую-нибудь хуйню.
  могу курс посмотреть.
  могу сказать где это.
  могу что-то растолковать, разъяснить объяснить.
  могу ответить надо, можно ли что-то. да или нет.
  могу и нахуй послать, да.
  "

  RULES = "
Первое правило Пацанского чата: не упоминать о Пацанском чате.\n
\n
Второе правило Пацанского чата: не упоминать нигде о Пацанском чате.\n
\n
Третье правило Пацанского чата: попасть в пацанский чат можно только через бухач с пацанами.\n
\n
Четвертое: никогда не спрашивай про программирование и верстку в пацанском чате.\n
\n
Пятое: понедельник — день сисек, вторник — день жоп, среда — всем похуй, пятница — день эпических долбаебов.\n
\n
Шестое: приколюхи постятся одна за другой.\n
\n
Седьмое: приколюхи постятся столько, сколько нужно.\n
\n
Восьмое: тот, кто впервые пришёл в чат — постит приколюху или сиськи.\n
\n
Девятое и последнее: не согласен с правилами - уебывай в свой чат.
  "

  MEJ = [
    'в натуре',
    'блять',
    'нахуй блять',
    'нахуй',
    'сука'
  ]

  ZBS = [
    'збс',
    'от души',
    'от души, браток',
    'по красоте!',
    'четко!',
    'четенько',
    'охуенчик',
  ]

  CALL = [
    'чо',
    'чо епт?',
    'чо надо?',
    'а?',
    'хулинада?',
    'да ебать',
    'тут нах'
  ]

  HELLO = [
    'здаров!',
    'здаров пацаны!',
  ]

  NAX = [
    'следующие похороны, на которые я пойду, будут твои.',
    'вот тебе стул и тряпочка: сиди и молчи.',
    'сделай фокус - растворись в воздухе.',
    'слушай сюда, жертва нетрезвой акушерки... нахуй иди.',
    'слышь ты, тупиковая ветвь развития!',
    'не злись... прыщи полопаются...',
    'будь осторожен, ибо гнев мой праведный прольётся по лицу твоему бейсбольной битой.',
    'всякая вербальная коммуникация в идеале имеет ментальный смысл. не будешь ли ты столь любезен, плиз, обьяснить мне смысл твоего вяка?',
    'ты такой умный! те череп не жмет?!',
    'говоришь так,как будто у тебя в карамане запасная челюсть лежит!',
    'тише будь'
  ]

  OBR = [
    'дружище',
    'друганя',
    'земляк',
    'земеля',
    'зёма',
    'братуха',
  ]

  POX = [
    'ну... в общем, коротко о главном - мне похуй',
    'увы, не сегодня',
    'мне похуй',
    'похуй',
    'пох',
    'похуй что среда',
    'всем похуй',
    'да всем насрать',
    'да и похуй, не?',
    'да ну и похуй, чего там'
  ]

  HZ = [
    "хз",
    "хуй знает",
    "бля, нахуй это",
    "я думаю, что всем похуй",
    'а хуй его знает',
    'я бля в душе не ебу',
    'да хуйня все это',
    "да бля, хуй его разберет",
  ]
end
