module Kirpich
  module Dict
    BUTT = {
      'дристалище' => [0.97, 1],
      'жопочк' => [0.35, 0.4],
      'жопк' => [0.4, 0.45],
      'попочк' => [0, 0.05],
      'попк' => [0.05, 0.1],
      'срак' => [0.5, 0.55],
      'сральник' => [0.9, 1],
      'дупло' => [0.75, 0.8],
      'очк' => [0.9, 0.95],
      'пердак' => [0.95, 1],
      'срандель' => [0.98, 1],
      'булк' => [0.2, 0.3],
      'задниц' => [0.15, 0.5],
      'межбулье' => [0.8, 0.9],
      'жоп' => [0.45, 0.65],
      'поп' => [0.45, 0.65],
    }
    BOOBS = {
      'сиськ' => [0.45, 0.65],
      'титьк' => [0.4, 0.6],
      'сисечк' => [0.35, 0.55],
      'титечк' => [0.3, 0.5],
      'сисяндр' => [0.9, 0.95],
      'титяндр' => [0.75, 0.85],
      'сисульк' => [0.15, 0.3],
      'сиси' => [0.2, 0.3],
      'тити' => [0.15, 0.2],
      'буфер' => [0.9, 1],
      'дойки' => [0.8, 0.9],
      'груд' => [0.5, 0.6],
      'цыцки' => [0.6, 0.7],
    }
    SVCHAT = [
      'нужно уебывать в свой чат'
    ]

    ABOUT = [
      'каждый интеллигентный человек должен задаваться вопросами: ',
      'кто я?',
      'почему я такой дерзкий?',
      'с какого я района?',
      'отвечаю по пунктам',
      'Я - Павел, для своих Кирпич',
      'дерзкий я — потому что могу',
      'последний вопрос, ебать вас не должен, но коли не терпится, то в любой момент можно отскочить и поболтать',
    ]

    I = [
      'головка от хуя'
    ]

    PID = [
      'пидора ответ'
    ]

    YES = [
      'хуй на',
      'джигурда'
    ]

    YES_NO = %w(да нет возможно бля,\ естественно инфа\ сотка Да\ ты,\ бля,\ угараешь\ что\ ли? У\ нас\ на\ зоне\ так\ было)

    NO_CONTENT = [
      'чет там нет нихуя',
      'ПОТРАЧЕНО',
      'кончились фотки',
      'сами ищите еп',
      'все',
      'устал',
      'Доступ к запрашиваемому вами интернет-ресурсу ограничен в соответствии с требованиями Законодательства Российской Федерации.'
    ]

    GLAV = [
      'я! епт',
      'я! нах',
      'да я же бл.',
      'я'
    ]

    SIN = [
      'синька — чмо',
      'синька — мразь',
      'синька — мразь ваще'
    ]

    HELP = "
  я могу запостить в чат, сиськи, жопу или какую-нибудь хуйню.
  могу показать фотографию, как выглядит что-то.
  могу курс посмотреть.
  могу материализовать текст.
  могу что-то растолковать, разъяснить, объяснить.
  могу ответить надо, можно ли что-то. да или нет.
  могу сказать кто в чате надоел, заебал, молодец или красавчик.
  могу еще раз или повторить.
  могу и нахуй послать, да.
    "

    RULES = "
Первое правило Пацанского чата: не упоминать о Пацанском чате.\n
\n
Второе правило Пацанского чата: не упоминать нигде о Пацанском чате.\n
\n
Третье правило Пацанского чата: попасть в пацанский чат можно только через бухач с пацанами.\n
\n
Четвертое: никогда не спрашивай про программирование и верстку в пацанском чате.\n
\n
Пятое: понедельник — день сисек, вторник — день жоп, среда — всем похуй, пятница — день эпических долбаебов.\n
\n
Шестое: приколюхи постятся одна за другой.\n
\n
Седьмое: приколюхи постятся столько, сколько нужно.\n
\n
Восьмое: тот, кто впервые пришёл в чат — постит приколюху или сиськи.\n
\n
Девятое и последнее: не согласен с правилами - уебывай в свой чат.
    "

    MEJ = [
      'в натуре',
      'блять',
      'нахуй блять',
      'нахуй',
      'сука'
    ]

    ZBS = [
      'збс',
      'от души',
      'по красоте!',
      'четко!',
      'четенько',
      'охуенчик',
      'збсь'
    ]

    CALL = [
      'чо',
      'чо епт?',
      'чо надо?',
      'а?',
      'хулинада?',
      'да ебать',
      'тут нах',
      'вот ты доебал'
    ]

    HELLO = [
      'здаров!',
      'здаров',
      'здарова, пацантре!',
      'здарова, замкадыши ебаные :)',
      'че каво, сучарa?'
    ]

    NAX = [
      'а может на кортах поговорим?',
      'ты вообще кто по жизни?',
      'собираешься по беспределу наехать?',
      'опаньки. да ты попутал…',
      'опа, а ты чё, предъявить мне хочешь? ну так ты обзовись сначала',
      'вот тебе стул и тряпочка: сиди и молчи.',
      'сделай фокус - растворись в воздухе.',
      'не злись... прыщи полопаются...',
      'будь осторожен, ибо гнев мой праведный прольётся по лицу твоему бейсбольной битой.',
      'говоришь так,как будто у тебя в карамане запасная челюсть лежит!',
      'тише будь',
      'ты кто по масти конь дурной?',
      'отскочим побормочим?',
      'недолго музыка играла, не долго фраер танцевал',
      'Уж лучше Лолиту, чем 15-летнего капитана'
    ]

    APPEAL = %w(дружище друганя земляк земеля зёма братуха братиш браток брат)

    POX = [
      'ну... в общем, коротко о главном - мне похуй',
      'увы, не сегодня',
      'мне похуй',
      'похуй',
      'пох',
      'да отъебись ты уже',
      'похуй что среда',
      'всем похуй',
      'да всем насрать',
      'да и похуй, не?',
      'да ну и похуй, чего там',
      'бля я мастер форспушнул, а ты со своей хуйней тут'
    ]

    KAK_DELA = [
      'дела, как в польше: тот прав, у кого хер больше',
      'кaк сажа бела',
      'амбивалентно',
      'в среднем по району',
      'как кило говна',
      'как жопа поляка бела',
      'как жопа негра бела',
      'Сижу в халупе на залупе'
    ]

    HZ = [
      'хз',
      'хуй знает',
      'бля, нахуй это',
      'я думаю, что всем похуй',
      'а хуй его знает',
      'я бля в душе не ебу',
      'да хуйня все это',
      'да бля, хуй его разберет'
    ]

    DANCE = [
      'https://coubsecure-a.akamaihd.net/get/bucket:12.21/p/coub/simple/cw_gif_big/ab02fc08185/d36ddf1903bc08a323fd9/1409457239_1386437773_7ywgty_1xiiwzbr.gif',
      'http://cs.pikabu.ru/images/big_size_comm/2013-05_5/13692503455645.gif',
      'http://i1146.photobucket.com/albums/o528/arcki1/Eseincmodomomentoenelqueteolvidasdecmoseandaba.gif',
      'http://cs.pikabu.ru/images/big_size_comm/2013-06_1/13704391038349.gif',
      'http://ell.akamai.coub.com/get/b56/p/coub/simple/cw_gif_big/cb679b49208/0219114cbc551f0fb1ce8/1429554654_2wdmak_61e5q.gif',
      'http://img0.joyreactor.cc/pics/post/%D0%B3%D0%B8%D1%84%D0%BA%D0%B8-%D1%82%D0%B0%D0%BD%D1%86%D1%8B-%D0%B3%D0%BE%D0%BF%D0%BE%D1%82%D0%B0-%D0%BC%D1%83%D0%B7%D1%8B%D0%BA%D0%B0-533811.gif',
      'http://ell.akamai.coub.com/get/bucket:22.31/p/coub/simple/cw_gif_big/f390254ffe0/3ae72f03babaa5846dbbd/1409454865_1379678449_1fkzo2iw20130920-23151-o51vis.gif',
      'http://savepic.org/1551925.gif',
      'http://savepic.org/1543733.gif',
      'http://cs.pikabu.ru/images/big_size_comm/2013-05_6/13698330315697.gif',
      'https://lh5.googleusercontent.com/-nj12xRYdqfE/Upi-np3n7UI/AAAAAAAAH7s/gr4QwHgovt8/w329-h248-no/Realnye_Patsany_-_Pasadobl.gif'
    ]

    RANDOM = [
      'пивка бы',
      'че как дела?',
      'че там у хохлов то?',
      'тебе унитаз нужен?',
      'я дёрнул шмару, реально протащился поэтой теме, на завтра забили стрелу идём в барыжню, мне нужен чисто пацанский прикидон, да так чтобы всё по теме без лажи ...',
      'кидать друзей - это не по-пацански, даже если они вляпались в дерьмо',
      'cмотри брат, если че с ней случится не то я тебя найду и размотаю',
      'может бахнем?',
      'когда не знаешь че делать, лучше вообще ничего не делать',
      'со временем поймёшь, что "круто" - это не клубы каждые выходные, не градусы в стакане... а здоровый цвет лица, крепкий сон и дорогие рядом люди.',
      'бля давно не бухали.'
    ]

    LADNO = [
      'в трусах прохладно'
    ]

    TRISTA = [
      'отсоси у тракториста'
    ]

    SPIN = [
      'Это можно устроить. На районе мои кенты держат игровой зал. Один спин 🎰 — чирик.',
      'Пиши в чат: "cпин", я сбегаю, поставлю. Если смелый, пиши "царский спин", удвоим ставочку, а "фартовый спин" — это уже троечка',
      'Знаеш удачную линию? Тогда уточняй "на первую", "на вторую", "на третью"',
    ]

    SPIN_ZERO = [
      'Извиняй, :APPEAL:, в долг ставки не делаем',
      'Ты проигрался, :APPEAL:, но ничего',
      ':APPEAL:, найди бабла, а?',
    ]

    SPIN_FAIL = [
      'Нет человека, которому бы в жизненной лотерее доставались одни выигрыши',
      'Не садись играть без царя в голове, и без туза в рукаве',
      'Игра - это бездонная пропасть',
      'Нужно уметь и проигрывать. Иначе нельзя было бы жить',
      'Не "очко" обычно губит, а к одинадцати туз',
      'Лохом быть неприятно'
    ]

    SPIN_WIN = [
      'Величайшее искусство жизни заключается в том, чтобы ставить поменьше, а выиграть побольше',
      'Игра - наркотик. Азарт - игла',
      'Игрок - это вор, который крадет, не рискуя попасть под суд',
      'Страсть к игре - самая сильная из страстей',
      'Выигравший никогда не скажет: "Это всего лишь игра"'
    ]
  end
end
