module Kirpich
  module Dict
    SVCHAT = [
      'нужно уебывать в свой чат'
    ]

    ABOUT = [
      'каждый интеллигентный человек должен задаваться вопросами: ',
      'кто я?',
      'почему я такой дерзкий?',
      'с какого я района?',
      'отвечаю по пунктам',
      'Я - Павел, для своих Кирпич',
      'дерзкий я — потому что могу',
      'последний вопрос, ебать вас не должен, но коли не терпится, то в любой момент можно отскочить и поболтать',
    ]

    I = [
      'головка от хуя'
    ]

    PID = [
      'пидора ответ'
    ]

    YES = [
      'хуй на',
      'джигурда'
    ]

    YES_NO = %w(да нет возможно бля,\ естественно инфа\ сотка Да\ ты,\ бля,\ угараешь\ чтоли?)

    NO_GIRLS = [
      'чет там нет нихуя',
      'ПОТРАЧЕНО',
      'кончились фотки',
      'сами ищите еп',
      'все',
      'устал'
    ]

    GLAV = [
      'я! епт',
      'я! нах',
      'да я же бл.',
      'я'
    ]

    SIN = [
      'синька — чмо',
      'синька — мразь',
      'синька — мразь ваще'
    ]

    HELP = "
  я могу запостить в чат, сиськи, жопу или какую-нибудь хуйню.
  могу показать фотографию, как выглядит что-то.
  могу курс посмотреть.
  могу материализовать текст.
  могу что-то растолковать, разъяснить, объяснить.
  могу ответить надо, можно ли что-то. да или нет.
  могу сказать кто в чате надоел, заебал, молодец или красавчик.
  могу еще раз или повторить.
  могу и нахуй послать, да.
    "

    RULES = "
Первое правило Пацанского чата: не упоминать о Пацанском чате.\n
\n
Второе правило Пацанского чата: не упоминать нигде о Пацанском чате.\n
\n
Третье правило Пацанского чата: попасть в пацанский чат можно только через бухач с пацанами.\n
\n
Четвертое: никогда не спрашивай про программирование и верстку в пацанском чате.\n
\n
Пятое: понедельник — день сисек, вторник — день жоп, среда — всем похуй, пятница — день эпических долбаебов.\n
\n
Шестое: приколюхи постятся одна за другой.\n
\n
Седьмое: приколюхи постятся столько, сколько нужно.\n
\n
Восьмое: тот, кто впервые пришёл в чат — постит приколюху или сиськи.\n
\n
Девятое и последнее: не согласен с правилами - уебывай в свой чат.
    "

    MEJ = [
      'в натуре',
      'блять',
      'нахуй блять',
      'нахуй',
      'сука'
    ]

    ZBS = [
      'збс',
      'от души',
      'по красоте!',
      'четко!',
      'четенько',
      'охуенчик',
      'збсь'
    ]

    CALL = [
      'чо',
      'чо епт?',
      'чо надо?',
      'а?',
      'хулинада?',
      'да ебать',
      'тут нах',
      'вот ты доебал'
    ]

    HELLO = [
      'здаров!',
      'здаров',
      'здарова, пацантре!',
      'здарова, замкадыши ебаные :)',
      'че каво, сучарa?'
    ]

    NAX = [
      'а может на кортах поговорим?',
      'ты вообще кто по жизни?',
      'собираешься по беспределу наехать?',
      'опаньки. да ты попутал…',
      'опа, а ты чё, предъявить мне хочешь? ну так ты обзовись сначала',
      'вот тебе стул и тряпочка: сиди и молчи.',
      'сделай фокус - растворись в воздухе.',
      'не злись... прыщи полопаются...',
      'будь осторожен, ибо гнев мой праведный прольётся по лицу твоему бейсбольной битой.',
      'говоришь так,как будто у тебя в карамане запасная челюсть лежит!',
      'тише будь',
      'ты кто по масти конь дурной?',
      'отскочим побормочим?',
      'недолго музыка играла, не долго фраер танцевал'
    ]

    APPEAL = %w(
      дружище
      друганя
      земляк
      земеля
      зёма
      братуха
      братиш
      браток
      брат)

    POX = [
      'ну... в общем, коротко о главном - мне похуй',
      'увы, не сегодня',
      'мне похуй',
      'похуй',
      'пох',
      'да отъебись ты уже',
      'похуй что среда',
      'всем похуй',
      'да всем насрать',
      'да и похуй, не?',
      'да ну и похуй, чего там'
    ]

    KAK_DELA = [
      'дела, как в польше: тот прав, у кого хер больше',
      'кaк сажа бела',
      'амбивалентно',
      'в среднем по району',
      'как кило говна',
      'как жопа поляка бела',
      'как жопа негра бела'
    ]

    HZ = [
      'хз',
      'хуй знает',
      'бля, нахуй это',
      'я думаю, что всем похуй',
      'а хуй его знает',
      'я бля в душе не ебу',
      'да хуйня все это',
      'да бля, хуй его разберет'
    ]

    DANCE = [
      'https://coubsecure-a.akamaihd.net/get/bucket:12.21/p/coub/simple/cw_gif_big/ab02fc08185/d36ddf1903bc08a323fd9/1409457239_1386437773_7ywgty_1xiiwzbr.gif',
      'http://cs.pikabu.ru/images/big_size_comm/2013-05_5/13692503455645.gif',
      'http://i1146.photobucket.com/albums/o528/arcki1/Eseincmodomomentoenelqueteolvidasdecmoseandaba.gif',
      'http://cs.pikabu.ru/images/big_size_comm/2013-06_1/13704391038349.gif',
      'http://ell.akamai.coub.com/get/b56/p/coub/simple/cw_gif_big/cb679b49208/0219114cbc551f0fb1ce8/1429554654_2wdmak_61e5q.gif',
      'http://img0.joyreactor.cc/pics/post/%D0%B3%D0%B8%D1%84%D0%BA%D0%B8-%D1%82%D0%B0%D0%BD%D1%86%D1%8B-%D0%B3%D0%BE%D0%BF%D0%BE%D1%82%D0%B0-%D0%BC%D1%83%D0%B7%D1%8B%D0%BA%D0%B0-533811.gif',
      'http://ell.akamai.coub.com/get/bucket:22.31/p/coub/simple/cw_gif_big/f390254ffe0/3ae72f03babaa5846dbbd/1409454865_1379678449_1fkzo2iw20130920-23151-o51vis.gif',
      'http://savepic.org/1551925.gif',
      'http://savepic.org/1543733.gif',
      'http://cs.pikabu.ru/images/big_size_comm/2013-05_6/13698330315697.gif',
      'https://lh5.googleusercontent.com/-nj12xRYdqfE/Upi-np3n7UI/AAAAAAAAH7s/gr4QwHgovt8/w329-h248-no/Realnye_Patsany_-_Pasadobl.gif'
    ]
  end
end
